In [3]:
import numpy as np
import pandas as pd

Here v built a movies data frame that contains users and their ratings for 3 movies

In [2]:
myData={"User1":[3,4,np.nan],"User2":[4,np.nan,np.nan],"User3":[4,5,2]}
movie_df=pd.DataFrame(myData)
movie_df

   User1  User2  User3
0    3.0    4.0      4
1    4.0    NaN      5
2    NaN    NaN      2

First Method of Data Clean Up ,using dropna() - rarely used

In [3]:
movie_df.dropna(axis=0,)

   User1  User2  User3
0    3.0    4.0      4

In [4]:
movie_df

   User1  User2  User3
0    3.0    4.0      4
1    4.0    NaN      5
2    NaN    NaN      2

Second method of data claen up using fillna()

In [5]:
movie_df.fillna(0)

   User1  User2  User3
0    3.0    4.0      4
1    4.0    0.0      5
2    0.0    0.0      2

Another method is to find the mean of rows or columns

here v find the mean of a series object ie, column User1
and replace NaN values in each columns with that calculated mean.

In [6]:
movie_df.fillna(value=movie_df['User1'].mean())

   User1  User2  User3
0    3.0    4.0      4
1    4.0    3.5      5
2    3.5    3.5      2

In [7]:
type(movie_df['User1'])

pandas.core.series.Series

**Example**

In [4]:
marks_df=pd.DataFrame(data={'machine_learning':[34,23,np.nan,45],
                            'Data Mining':[np.nan,45,12,25],
                            'Web Development':[45,22,13,41],
                            'Cryptography':[47,30,49,np.nan]
                           },index=['test1','test2','test3','test4'])
marks_df

       machine_learning  Data Mining  Web Development  Cryptography
test1              34.0          NaN               45          47.0
test2              23.0         45.0               22          30.0
test3               NaN         12.0               13          49.0
test4              45.0         25.0               41           NaN

In [9]:
marks_df.fillna(value=marks_df['Web Development'].mean(),inplace=True)
marks_df

       machine_learning  Data Mining  Web Development  Cryptography
test1             34.00        30.25               45         47.00
test2             23.00        45.00               22         30.00
test3             30.25        12.00               13         49.00
test4             45.00        25.00               41         30.25

In [10]:
marks_df.machine_learning.loc['test4']

45.0

In [10]:
import numpy as np
import pandas as pd

In [11]:
marks_df

       machine_learning  Data Mining  Web Development  Cryptography
test1             34.00        30.25               45         47.00
test2             23.00        45.00               22         30.00
test3             30.25        12.00               13         49.00
test4             45.00        25.00               41         30.25

In [1]:
movies_dict={"Movies":['Starwars','Starwars','Batman','Batman','Deadpool','Deadpool'],
        "Viewers":['Ajith','Sachin','George','Gitto','Arjun','Adharsh'],
        "Ratings":[10,7,6,9,8,3]
        }
movies_dict

{'Movies': ['Starwars',
  'Starwars',
  'Batman',
  'Batman',
  'Deadpool',
  'Deadpool'],
 'Viewers': ['Ajith', 'Sachin', 'George', 'Gitto', 'Arjun', 'Adharsh'],
 'Ratings': [10, 7, 6, 9, 8, 3]}

In [2]:
mov_df=pd.DataFrame(movies_dict)
mov_df

NameError: name 'pd' is not defined

In [14]:
mov_df

     Movies  Viewers  Ratings
0  Starwars    Ajith       10
1  Starwars   Sachin        7
2    Batman   George        6
3    Batman    Gitto        9
4  Deadpool    Arjun        8
5  Deadpool  Adharsh        3

# pandas.DataFrame.groupby

DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=False, observed=False, **kwargs)[source]



Group DataFrame or Series using a mapper or by a Series of columns.

In [15]:
mov_df.groupby(by='Movies')

here v group the dataframe based on column "Movies" 
bt it returned a groupby object
to return a result surely need to perform operations on that grouped data.


so find the mean of each groups in Movies columns 
ie. it computes the mean of Ratings belonging to each group in the Movies column.
groups are batman,Deadpool and Starwars.

In [16]:
mov_df.groupby('Movies').mean()

# here v group the dataframe using Movies Series.

          Ratings
Movies
Batman        7.5
Deadpool      5.5
Starwars      8.5

**Sample 1**

In [17]:
mov_df.groupby('Movies').sum().iloc[2]

Ratings    17
Name: Starwars, dtype: int64

**Sample 2**

In [18]:
mov_df.groupby('Movies').mean().loc['Batman']

Ratings    7.5
Name: Batman, dtype: float64

In [19]:
marks_df

       machine_learning  Data Mining  Web Development  Cryptography
test1             34.00        30.25               45         47.00
test2             23.00        45.00               22         30.00
test3             30.25        12.00               13         49.00
test4             45.00        25.00               41         30.25

In [20]:
semesters=['sem1','sem1','sem2','sem2']
marks_df['semesters']=semesters

In [21]:
marks_df

       machine_learning  Data Mining  Web Development  Cryptography semesters
test1             34.00        30.25               45         47.00      sem1
test2             23.00        45.00               22         30.00      sem1
test3             30.25        12.00               13         49.00      sem2
test4             45.00        25.00               41         30.25      sem2

In [22]:
marks_df.groupby(by="semesters",).mean()

           machine_learning  Data Mining  Web Development  Cryptography
semesters
sem1                 28.500       37.625             33.5        38.500
sem2                 37.625       18.500             27.0        39.625

Selecting row sem1 to get the each entries in it

In [23]:
marks_df.groupby('semesters').sum().loc['sem1']

machine_learning    57.00
Data Mining         75.25
Web Development     67.00
Cryptography        77.00
Name: sem1, dtype: float64

In [24]:
marks_df.groupby('semesters').mean().loc['sem1']

machine_learning    28.500
Data Mining         37.625
Web Development     33.500
Cryptography        38.500
Name: sem1, dtype: float64


# pandas.DataFrame.describe¶



DataFrame.describe(percentiles=None, include=None, exclude=None)[source]
Generate descriptive statistics that summarize the central tendency, dispersion and shape of a dataset’s distribution, excluding NaN values.

In [25]:
marks_df.describe()

       machine_learning  Data Mining  Web Development  Cryptography
count          4.000000     4.000000         4.000000      4.000000
mean          33.062500    28.062500        30.250000     39.062500
std            9.175091    13.650969        15.261608     10.352888
min           23.000000    12.000000        13.000000     30.000000
25%           28.437500    21.750000        19.750000     30.187500
50%           32.125000    27.625000        31.500000     38.625000
75%           36.750000    33.937500        42.000000     47.500000
max           45.000000    45.000000        45.000000     49.000000

In [26]:
mov_df.describe()

         Ratings
count   6.000000
mean    7.166667
std     2.483277
min     3.000000
25%     6.250000
50%     7.500000
75%     8.750000
max    10.000000